tap "dbt-labs/dbt"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "microsoft/git"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Console Matrix
brew "cmatrix"
# C library implementing the SSH2 protocol
brew "libssh2"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Distributed revision control system
brew "git"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Cross-platform Java Version Manager
brew "jabba"
# Lazier way to manage everything docker
brew "lazydocker"
# Implementation of the file(1) command
brew "libmagic"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General-purpose scripting language
brew "php"
# Python version management
brew "pyenv"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Bigquery adapter plugin for dbt
brew "dbt-labs/dbt/dbt-bigquery"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Command-line shell and scripting language
cask "powershell"
vscode "eamodio.gitlens"
vscode "github.vscode-github-actions"
vscode "googlecloudtools.cloudcode"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "NecatiARSLAN.airflow-vscode-extension"
vscode "samuelcolvin.jinjahtml"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
