tap "dbt-labs/dbt"
tap "jesseduffield/lazygit"
tap "knqyf263/pet"
tap "microsoft/git"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "asdf"
brew "bash-completion"
brew "cmatrix"
brew "libssh2"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "gh"
brew "git"
brew "go"
brew "librsvg"
brew "graphviz"
brew "jabba"
brew "kafka"
brew "kcat"
brew "lazydocker"
brew "libmagic"
brew "ncdu"
brew "neovim"
brew "nvm"
brew "php"
brew "pyenv"
brew "python@3.11"
brew "python-tk@3.11"
brew "python@3.9"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "yazi"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "jesseduffield/lazygit/lazygit"
brew "knqyf263/pet/pet"
cask "docker"
cask "font-hack-nerd-font"
cask "powershell"
cask "shortcat"
cask "visual-studio-code"
vscode "eamodio.gitlens"
vscode "github.vscode-github-actions"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "necatiarslan.airflow-vscode-extension"
vscode "samuelcolvin.jinjahtml"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
